Repository: axento/Infinite-CMS
Catalog: application/configs/global.tmx
Source language: en
Languages: fr

source: Homepage
fr: Page d'acceuil

source: Sign in
fr: Aanmelden

source: Sign in to your account
fr: Aanmelden in jouw account

source: Sign out
fr: Afmelden

source: Sign up
fr: Registreren

source: My profile
fr: Mijn profiel

source: Choose language
fr: Taalkeuze

source: Latest creations
fr: Nieuwste ontwerpen

source: About me
fr: Over mij

source: My designs
fr: Mijn ontwerpen

source: Create new account
fr: Maak een nieuw account aan

source: Contact us
fr: Contacteer ons

source: Be social
fr: Wees sociaal

source: Newsletter
fr: Nieuwsbrief

source: See details
fr: Bekijk details

source: Buy
fr: Kopen

source: See profile
fr: Profiel weergeven

source: Submit
fr: Verzenden

source: Send
fr: Aanvragen

source: Sign up now
fr: Registreer nu

source: Create account
fr: Account aanmaken

source: Designed by
fr: Ontworpen door

source: Name
fr: Naam

source: First name
fr: Voornaam

source: Birthday
fr: Geboortedatum

source: Zip
fr: Postcode

source: City
fr: Gemeente

source: Password
fr: Paswoord

source: Remember me
fr: Laat mij aangemeld blijven

source: Not registered?
fr: Niet geregistreerd?

source: Create an account
fr: Maak een account aan

source: Lost your password?
fr: Paswoord vergeten?

source: Click here to recover
fr: Klik hier om een nieuw paswoord aan te vragen

source: Enter your email address and we will send you a link to reset your password
fr: Geef hieronder je e-mailadres en we sturen je een nieuw paswoord

source: Choose country:
fr: Kies jouw land:

source: Your first name
fr: Vul uw voornaam in

source: Enter your name here
fr: Vul hier uw naam in

source: Your name
fr: Vul uw naam in

source: Enter E-mail
fr: Adresse e-amail

source: Choose password
fr: Kies een paswoord

source: Repeat password
fr: Herhaal paswoord

source: Choose country
fr: Kies land

source: Enter birthday
fr: Vul uw geboortedatum in

source: Enter street
fr: Vul uw straat in

source: Enter zip
fr: Postcode

source: Enter city
fr: Vul uw gemeente in
